/**
-----------------泛型
01-常用对象API(集合框架-泛型-概述).avi (23: 7)
02-常用对象API(集合框架-泛型-擦除&补偿).avi (12:43)
03-常用对象API(集合框架-泛型-在集合中的应用).avi (21:11)
04-常用对象API(集合框架-泛型-泛型类).avi (14:14)
05-常用对象API(集合框架-泛型-泛型方法).avi (12:42)
06-常用对象API(集合框架-泛型-泛型接口).avi ( 4:19)
07-常用对象API(集合框架-泛型-泛型限定(上限)).avi (25:45)
08-常用对象API(集合框架-泛型-泛型限定(下限)).avi ( 5:53)
09-常用对象API(集合框架-泛型-泛型限定(上限的体现)).avi (11:42)
10-常用对象API(集合框架-泛型-泛型限定(下限的体现)).avi (18: 1)
11-常用对象API(集合框架-泛型-泛型限定(通配符的体现)).avi ( 8:16)
12-常用对象API(集合框架-集合查阅的技巧).avi ( 8:10)
 */
/**
 * @author zhanghongwei
 *
 */
package itcastday18;